reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["url", "lekshfase.k.com"], ["content", "test"], ["sub_id", 1], ["author_id", 3], ["created_at", "2022-11-18 22:54:09.430176"], ["updated_at", "2022-11-18 22:54:09.430176"]]
---
    def create
        # debugger
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        @post.sub_id = params[:sub_id]
        if @post && @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @post = Post.find_by(id: params[:id])