reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "moderators are stupid"], ["description", "465483513"], ["moderator_id", 2], ["created_at", "2022-11-18 20:13:28.514509"], ["updated_at", "2022-11-18 20:13:28.514509"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub && @sub.save

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "idk, there are over 1000"], ["updated_at", "2022-11-18 23:22:32.202805"], ["id", 1]]
---
    def update
        @sub = current_user.subs.find_by(id: params[:id])
        if @sub && @sub.moderator_id == current_user.id
            if @sub.update(sub_params)