reddit_clone/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user && @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "chadmander"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-18 19:38:41.773304"], ["updated_at", "2022-11-18 19:38:41.773304"]]